Tekla Open API Reference for Tekla Structures 2025
FormBase Properties
The FormBase type exposes the following members.
Properties
Name | Description
Localization
 The localization instance for the dialog. Each dialog has its own localization instance that has read the localization files needed for that dialog.
Top
See Also
Reference
FormBase Class
Tekla.Structures.Dialog Namespace